Documents/ЛБ_ПеремещениеОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПеремещениеОбъектовЗалога</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОприходованныеОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОборотыПоОперациямЗайма</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеЗалоговогоБилета</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаВСумке</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеОбъектаЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеремещенияОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПеремещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомераПеремещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_КатегорииПоступленияОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИЗLX</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Comment>Объект залога</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОценки</Name>
							<Comment>Сумма оценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтказОтВыкупа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ГруппыОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГруппыОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыПеремещенияОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПеремещенияОбъектовЗалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутриПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВДругоеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторонннемуКонтрагенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_КатегорииПоступленияОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_КатегорииПоступленияОбъектовЗалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поштучно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ПеремещениеОбъектовЗалога/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;	
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
		Объект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВДругоеПодразделение;  
		Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно;
		Объект.Дата = ТекущаяДатаСеанса();
		ЭтаФорма.Заголовок = "Перемещение объектов залога (создание)";
	Иначе
		//ВидОперацииСтрока = " (" + Строка(Объект.ВидОперации) + ")";
	    ЭтаФорма.Заголовок = "Перемещение объектов залога № " + СокрЛП(Объект.ПредставлениеНомераПеремещения) + " от " + Формат(Объект.Дата, "ДЛФ=DT"); 
	КонецЕсли;
	УстановитьСостояниеДокумента();
	ЗаполнитьВыборКатегории();
	УстановитьВидимость();     
	ЗаполнитьТаблицуТоваров();    
	ТекущийВидОперации = Объект.ВидОперации;
	Элементы.СкладОтправитель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Откуда"));
	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Куда")); 
	
	Если Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;	
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьВыборКатегории()  
	Если Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно Тогда
		ЭтаФорма.ВыборКатегории = 0;
	Иначе   
		ЭтаФорма.ВыборКатегории = 1;
	КонецЕсли;	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПривестиЗначениеКуда()
	//Массив = Новый Массив(); 
	//Массив.Добавить(Тип("СправочникСсылка.ЛБ_Сотрудники")); 
	//Описание = Новый ОписаниеТипов(Массив);

	//Элементы.Куда.ОграничениеТипа = Описание; 
	//Объект.ЛомбардКуда = Описание.ПривестиЗначение(Объект.ЛомбардКуда);  
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокумента()
	Объект.Товары.Загрузить(ТаблицаТоваров.Выгрузить());
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыйНомерПеремещения()   
	СтруктураВозврата = Новый Структура;  
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	    НомерПеремещения = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерПеремещения(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.Ссылка); 
	Иначе   
		НомерПеремещения = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерПеремещения(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда);
	КонецЕсли;	
	СтруктураВозврата.Вставить("НомерПеремещения", НомерПеремещения);	
	Если Объект.ЛомбардОткуда = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
		ПредставлениеНомера = СокрЛП(НомерПеремещения);
	Иначе	
        ПредставлениеНомера = СокрЛП(Объект.ЛомбардОткуда.НомерЛомбарда) + "/" +  СокрЛП(НомерПеремещения);  
	КонецЕсли;	  
	СтруктураВозврата.Вставить("ПредставлениеНомера", ПредставлениеНомера);
    Возврат СтруктураВозврата;
КонецФункции	

&НаСервере
Функция ПроверкаОстатков() 
	ЕстьОшибки = Ложь;
	Если Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно Тогда
		ТаблицаОстатков = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель);   
		
		Для каждого Стр Из ТаблицаТоваров Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				Сообщить("Изделие с артикулом " + СокрЛП(Стр.Артикул) + " не найдено на складе " + СокрЛП(Объект.СкладОтправитель));  
				ЕстьОшибки = Истина;
			Конецесли;    
		Конеццикла;  
	ИначеЕсли Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда 
		ТаблицаОстатковВСумке = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВСумке(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель, Объект.НакладнаяНаОтгрузку);     
		
		Для каждого Стр Из ТаблицаТоваров Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаОстатковВСумке.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				Сообщить("Изделие с артикулом " + СокрЛП(Стр.Артикул) + " не найдено в сумке на складе " + СокрЛП(Объект.СкладОтправитель));  
			    ЕстьОшибки = Истина;
			Конецесли;  
		Конеццикла;  	
	КонецЕсли;
	
	Возврат ?(ЕстьОшибки, Ложь, Истина);
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьТаблицуДокумента();
	Если ЗначениеЗаполнено(Объект.ЛомбардОткуда) И (Объект.НомерПеремещения = 0) Тогда
		Результат = ПолучитьНовыйНомерПеремещения();
		Объект.НомерПеремещения = Результат.НомерПеремещения;
		Объект.ПредставлениеНомераПеремещения = Результат.ПредставлениеНомера;
	КонецЕсли;
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Если ТаблицаТоваров.Количество() = 0 Тогда
			Сообщить("Не выбраны изделия для перемещения.", статуссообщения.Важное);
			Отказ = Истина;
		КонецЕсли;    
		Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту") Тогда 
			Если НЕ ЗначениеЗаполнено(Объект.СкладПолучатель) Тогда
				Сообщить("Не выбран склад-получатель.", статуссообщения.Важное);
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;	
		Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения") Тогда 
			Если Объект.ЛомбардОткуда = Объект.ЛомбардКуда Тогда
				Сообщить("Для перемещения внутри подразделения используйте соответствующую операцию.", статуссообщения.Важное);
				Отказ = Истина; 	
			КонецЕсли;	  
			Если НЕ ЗначениеЗаполнено(Объект.Инкассатор) Тогда
				Сообщить("Не выбран инкассатор.", статуссообщения.Важное);
				Отказ = Истина; 
			КонецЕсли;
		КонецЕсли; 
		Если НЕ ПроверкаОстатков() Тогда  
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоги()
	ИтогКоличество = ТаблицаТоваров.Итог("Количество");
	ИтогВес = ТаблицаТоваров.Итог("ВесИзделия"); 
	ИтогВесМеталла = ТаблицаТоваров.Итог("ВесМеталла");
    ИтогСуммаОценки = ТаблицаТоваров.Итог("СуммаОценки");
	ИтогСуммаОценкиМакс = ТаблицаТоваров.Итог("СуммаОценкиМакс"); 
	ИтогСуммаОценкиМеталлы = ТаблицаТоваров.Итог("СуммаОценкиМеталлы");
	ИтогСуммаОценкиВставки = ТаблицаТоваров.Итог("СуммаОценкиВставки");
	ИтогСуммаСсуды = ТаблицаТоваров.Итог("СуммаСсуды");
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуТоваров()  
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из Объект.Товары Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);  
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров.Загрузить(ТаблицаЗапроса);
	ЗаполнитьИтоги();
КонецПроцедуры	

&НаСервере
Процедура ПолучитьТоварыПоОстаткам()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель);  
	Объект.Товары.Загрузить(ТаблицаЗапроса);
	Объект.Товары.Сортировать("ЗалоговыйБилет");
КонецПроцедуры	
	 
&НаКлиенте
Процедура Заполнить(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда  
		Сообщить("Выберите подразделение откуда передаются товары.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
		Сообщить("Выберите склад откуда передаются товары.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	
	ПолучитьТоварыПоОстаткам();
	ЗаполнитьТаблицуТоваров();
КонецПроцедуры 

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКатегорию()
    Если Объект.ЛомбардОткуда = Справочники.ЛБ_Ломбарды.ЦентральныйОфис И НЕ Объект.ЛомбардКуда = Справочники.ЛБ_Ломбарды.ЦентральныйОфис И ЗначениеЗаполнено(Объект.ЛомбардКуда) Тогда 
		Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно;
		ЗаполнитьВыборКатегории(); 
		Элементы.ВыборКатегории.ТолькоПросмотр = Истина; 
	ИначеЕсли НЕ Объект.ЛомбардОткуда = Справочники.ЛБ_Ломбарды.ЦентральныйОфис И ЗначениеЗаполнено(Объект.ЛомбардОткуда) И Объект.ЛомбардКуда = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда  
		Если ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
			Если Объект.СкладОтправитель.ВидСклада = Перечисления.ЛБ_ВидыСкладов.Залоги Тогда
			    Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка;  
				ЗаполнитьВыборКатегории(); 
			    Элементы.ВыборКатегории.ТолькоПросмотр = Истина; 
			ИначеЕсли Объект.СкладОтправитель.ВидСклада = Перечисления.ЛБ_ВидыСкладов.Витрина Тогда    
				Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно;
				ЗаполнитьВыборКатегории(); 
			    Элементы.ВыборКатегории.ТолькоПросмотр = Истина;   
			Иначе
				Элементы.ВыборКатегории.ТолькоПросмотр = ложь; 
			КонецЕсли;	
		КонецЕсли;	
	Иначе
		Элементы.ВыборКатегории.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимость()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения Тогда
		Элементы.Откуда.ТолькоПросмотр = Ложь;
		Элементы.Куда.ТолькоПросмотр = Истина; 
		Элементы.СкладПолучатель.Видимость = Истина;
		Элементы.Инкассатор.Видимость = Ложь; 
		Элементы.Куда.Заголовок = "Подразделение";    
		Элементы.ВыборКатегории.ТолькоПросмотр = Истина;
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВДругоеПодразделение Тогда	
		Элементы.Откуда.ТолькоПросмотр = Ложь; 
		Элементы.Куда.ТолькоПросмотр = Ложь;
		Элементы.СкладПолучатель.Видимость = Истина;
		Элементы.Инкассатор.Видимость = Истина;    
		Элементы.Куда.Заголовок = "Подразделение"; 
		УстановитьКатегорию();
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту Тогда
		Элементы.Откуда.ТолькоПросмотр = Истина; 
		Элементы.Куда.ТолькоПросмотр = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.Инкассатор.Видимость = Истина;
		Элементы.Куда.Заголовок = "Контрагент";   
		Элементы.ВыборКатегории.ТолькоПросмотр = Истина;
	КонецЕсли;	   
	Если Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда
		Элементы.ТаблицаТоваровГруппаКнопокОсновная.Видимость = Ложь; 
		Элементы.ТаблицаТоваровГруппаКнопокСумка.Видимость = Истина;
	Иначе
		Элементы.ТаблицаТоваровГруппаКнопокОсновная.Видимость = Истина; 
		Элементы.ТаблицаТоваровГруппаКнопокСумка.Видимость = Ложь;
	КонецЕсли;     
	//Если НЕ Объект.НомерПеремещения = 0 тогда 
	//	Элементы.Откуда.ТолькоПросмотр = Истина;
	//КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ИзменитьВидОперации()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения Тогда 
		Объект.ЛомбардКуда = Объект.ЛомбардОткуда; 		 
		Объект.Инкассатор = Справочники.ЛБ_Сотрудники.ПустаяСсылка(); 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВДругоеПодразделение Тогда
		Если ТипЗнч(Объект.ЛомбардКуда) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
			Объект.ЛомбардКуда = Справочники.ЛБ_Сотрудники.ПустаяСсылка();
		КонецЕсли;
		Объект.Инкассатор = неопределено;  		
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту Тогда
		Объект.ЛомбардОткуда = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
		Объект.ЛомбардКуда = Справочники._ДемоКонтрагенты.ПустаяСсылка(); 
		Объект.Инкассатор = неопределено; 
		Объект.СкладПолучатель = Справочники.ЛБ_Склады.ПустаяСсылка();
	КонецЕсли;	
	УстановитьВидимость();
	ТаблицаТоваров.Очистить();
КонецПроцедуры	

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Если НЕ Объект.ВидОперации = ТекущийВидОперации Тогда
		ТекущийВидОперации = Объект.ВидОперации;
		ИзменитьВидОперации();
		Элементы.СкладОтправитель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Откуда"));
	    Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Куда")); 
		Объект.НомерПеремещения = 0;
		Объект.ПредставлениеНомераПеремещения = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОткудаПриИзменении(Элемент)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения") Тогда 
		Объект.ЛомбардКуда = Объект.ЛомбардОткуда; 
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.ВДругоеПодразделение") Тогда 
		УстановитьКатегорию();  
		УстановитьВидимость();
	КонецЕсли;	

	Элементы.СкладОтправитель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Откуда"));
	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Куда")); 
	ТаблицаТоваров.Очистить(); 
	Объект.НомерПеремещения = 0;
	Объект.ПредставлениеНомераПеремещения = "";
КонецПроцедуры

&НаСервере
Функция ПолучитьТипКуда()
	Если ТипЗнч(Объект.ЛомбардКуда) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
		Возврат 1;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура КудаПриИзменении(Элемент) 
	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения") Тогда 
		Если ЗначениеЗаполнено(Объект.ЛомбардКуда) И Объект.ЛомбардОткуда = Объект.ЛомбардКуда Тогда
			Предупреждение("Для перемещения внутри подразделения используйте операцию внутреннего перемещения.", 60);
		КонецЕсли;			
	КонецЕсли;	     
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.ВДругоеПодразделение") Тогда 
		УстановитьКатегорию(); 
		УстановитьВидимость();
	КонецЕсли;	

	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту") Тогда 
		Если НЕ ПолучитьТипКуда() = 1 Тогда
		    Объект.ЛомбардКуда = ПредопределенноеЗначение("Справочник._ДемоКонтрагенты.ПустаяСсылка");  
		КонецЕсли;	
	Иначе
		Если НЕ ПолучитьТипКуда() = 0 Тогда	
		    Объект.ЛомбардКуда = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка");
		КонецЕсли;	
	КонецЕсли;
	
	Элементы.СкладОтправитель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Откуда"));
	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Куда"));
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов(Направление) 
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту") Тогда
	    ПроверятьКуда = Ложь; 
	Иначе 
		ПроверятьКуда = Истина;
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.ВидОперации) И ЗначениеЗаполнено(Объект.ЛомбардОткуда) И ?(НЕ ПроверятьКуда, Истина, ЗначениеЗаполнено(Объект.ЛомбардКуда)) Тогда 
		Если Направление = "Откуда" Тогда
		    ВидСкладаНаправление = Объект.СкладПолучатель.ВидСклада;
		Иначе
			ВидСкладаНаправление = Объект.СкладОтправитель.ВидСклада;
		КонецЕсли;	
        Возврат ЛБ_Общиймодуль.ПолучитьСписокВыбораСкладовДляПеремещения(Объект.ВидОперации, Объект.ЛомбардОткуда, Объект.ЛомбардКуда, Направление, ВидСкладаНаправление); 
	Иначе                    
		Возврат Новый Массив;
	КонецЕсли;
КонецФункции	


&НаСервере
Процедура ДобавитьВТаблицуТоваров(ТаблицаОЗ)  
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из ТаблицаОЗ Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);  
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет);
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		СтрокиТ = ТаблицаТоваров.НайтиСтроки(Отбор);
		Если СтрокиТ.Количество() = 0 Тогда
		    НоваяСтр = ТаблицаТоваров.Добавить(); 
			НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
			НоваяСтр.Артикул = Стр.Артикул;
			НоваяСтр.ВидИзделия = Стр.ВидИзделия;
			НоваяСтр.Проба = Стр.Проба;
			НоваяСтр.Категория = Стр.Категория;
			НоваяСтр.ВесИзделия = Стр.ВесИзделия;
			НоваяСтр.ВесМеталла = Стр.ВесМеталла;
			НоваяСтр.СуммаОценки = Стр.СуммаОценки;
			НоваяСтр.СуммаОценкиМакс = Стр.СуммаОценкиМакс;
			НоваяСтр.СуммаОценкиМеталлы = Стр.СуммаОценкиМеталлы;
			НоваяСтр.СуммаОценкиВставки = Стр.СуммаОценкиВставки;
			НоваяСтр.СуммаСсуды = Стр.СуммаСсуды;
			НоваяСтр.Количество = Стр.Количество;
			НоваяСтр.Вставки = Стр.Вставки;  
			НоваяСтр.Группа = Стр.Группа; 
		КонецЕсли;	
	Конеццикла;    
	ЗаполнитьИтоги();
КонецПроцедуры	

&НаСервере
Функция ПолучитьТоварыПоОстаткамАртикул(Артикул)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоАртикулу(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель, Артикул);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделие с артикулом " + сокрЛП(Артикул) + " на складе-отправителе не найдено.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоАртикулу(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда  
		Сообщить("Выберите подразделение откуда перемещаются изделия.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
		Сообщить("Выберите склад-отправитель.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Артикул = "";
	Если ВвестиЗначение(Артикул, "Введите артикул") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамАртикул(Артикул);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоНомеруЗБ(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель, НомерЗБ);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из залогогового билета № " + сокрЛП(НомерЗБ) + " на складе-отправителе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоНомеруЗБ(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда  
		Сообщить("Выберите подразделение откуда перемещаются изделия.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
		Сообщить("Выберите склад-отправитель.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	НомерЗБ = "";
	Если ВвестиЗначение(НомерЗБ, "Введите номер ЗБ") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьТоварыПоОстаткамПроба(Проба)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоПробе(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель, Проба);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из металла " + сокрЛП(Проба) + " на складе-отправителе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоПробе(Команда)   
	Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда  
		Сообщить("Выберите подразделение откуда перемещаются изделия.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
		Сообщить("Выберите склад-отправитель.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Проба = ПредопределенноеЗначение("Справочник.ЛБ_Пробы.ПустаяСсылка");
	Если ВвестиЗначение(Проба, "Выберите пробу", Тип("СправочникСсылка.ЛБ_Пробы")) Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамПроба(Проба);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамКатегория(Категория)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоКатегории(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель, Категория);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия категории " + сокрЛП(Категория) + " на складе-отправителе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоКатегории(Команда)   
	Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда  
		Сообщить("Выберите подразделение откуда перемещаются изделия.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
		Сообщить("Выберите склад-отправитель.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Категория = ПредопределенноеЗначение("Справочник.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка");
	Если ВвестиЗначение(Категория, "Выберите категорию", Тип("СправочникСсылка.ЛБ_КатегорииОбъектовЗалога")) Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамКатегория(Категория);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамБриллианты()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоВставкамБриллианты(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с бриллиантами на складе-отправителе не найдены.";
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьПоВставкамБриллианты(Команда)   
	Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда  
		Сообщить("Выберите подразделение откуда перемещаются изделия.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
		Сообщить("Выберите склад-отправитель.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	СтрокаСообщение = ПолучитьТоварыПоОстаткамБриллианты();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьТоварыПоОстаткамБезВставок()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаБезВставок(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с без вставок на складе-отправителе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьБезВставок(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда  
		Сообщить("Выберите подразделение откуда перемещаются изделия.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
		Сообщить("Выберите склад-отправитель.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	СтрокаСообщение = ПолучитьТоварыПоОстаткамБезВставок();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамДопМеталлы()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоДопМеталлам(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с несколькими металлами на складе-отправителе не найдены.";
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьПоДопМатериалам(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда  
		Сообщить("Выберите подразделение откуда перемещаются изделия.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
		Сообщить("Выберите склад-отправитель.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	СтрокаСообщение = ПолучитьТоварыПоОстаткамДопМеталлы();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамГруппа(Группа)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоГруппе(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель, Группа);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с группой " + сокрЛП(Группа) + " на складе-отправителе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда  
		Сообщить("Выберите подразделение откуда перемещаются изделия.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда  
		Сообщить("Выберите склад-отправитель.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Группа = ПредопределенноеЗначение("Справочник.ЛБ_ГруппыОбъектовЗалога.ПустаяСсылка");
	Если ВвестиЗначение(Группа, "Введите группу") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамГруппа(Группа);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьЗаемщика(ЗБ) 
	Возврат ЗБ.Залогодатель;
КонецФункции

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет) Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗаемщика(ТекСтрока.ЗалоговыйБилет));
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура КудаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту") Тогда
		ТипСтр = "СправочникСсылка._ДемоКонтрагенты";
	 ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.ВДругоеПодразделение") Тогда
		ТипСтр = "СправочникСсылка.ЛБ_Ломбарды";
	КонецЕсли;	
	Элементы.Куда.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	Элементы.Куда.ВыбиратьТип = Ложь; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьКатегорию() 
	Если ВыборКатегории = 0 Тогда
		Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно;  
	Иначе
		Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте    
Процедура КатегорияПриИзменении(Элемент)
	ПолучитьКатегорию(); 
	УстановитьВидимость();   
	Если Объект.Категория = ПредопределенноеЗначение("Перечисление.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка") И 
		  ЗначениеЗаполнено(Объект.ЛомбардОткуда) И ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда     
		ПараметрыФормы = новый Структура;   
		ПараметрыФормы.Вставить("Документ", Объект);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбора",ЭтаФорма);
		ОткрытьФорму("Документ.ЛБ_ПеремещениеОбъектовЗалога.Форма.ФормаВыбораВСумке", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры     

&НаКлиенте
Процедура ПослеВыбора(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено тогда  
		Возврат;
	КонецЕсли;	
	
	Объект.НакладнаяНаОтгрузку = Результат.НакладнаяНаОтгрузку; 
		
	ПолучитьТоварыВСумке();
	ЗаполнитьТаблицуТоваров()
КонецПроцедуры	

&НаСервере
Процедура ПолучитьТоварыВСумке()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВСумке(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель, Объект.НакладнаяНаОтгрузку);  
	Объект.Товары.Загрузить(ТаблицаЗапроса);
	Объект.Товары.Сортировать("ЗалоговыйБилет");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьВСумке(Команда)  
	Если ЗначениеЗаполнено(Объект.ЛомбардОткуда) И ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда     
		ПараметрыФормы = новый Структура;   
		ПараметрыФормы.Вставить("Документ", Объект);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбора",ЭтаФорма);
		ОткрытьФорму("Документ.ЛБ_ПеремещениеОбъектовЗалога.Форма.ФормаВыбораВСумке", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	Иначе
	    Предупреждение("Необходимо выбрать подразделение и склад-отправитель.", 60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.ВДругоеПодразделение") Тогда 
		УстановитьКатегорию(); 
		УстановитьВидимость();
	КонецЕсли;	

	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Куда"));  
	ТаблицаТоваров.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	Элементы.СкладОтправитель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Откуда"));
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
	ЭтаФорма.Заголовок = "Перемещение объектов залога № " + СокрЛП(Объект.ПредставлениеНомераПеремещения) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПослеУдаления(Элемент)
	ЗаполнитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЭтаФорма.Заголовок = "Перемещение объектов залога № " + СокрЛП(Объект.ПредставлениеНомераПеремещения) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
КонецПроцедуры
